trade_exp/src/InformationRegisters/ЛимитыДоговоров/ЛимитыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="94202788-354d-4302-af57-8056e962cbd2">
  <name>ЛимитыДоговоров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d157fce7-ad3e-492d-9534-f25cb76a5af7">
    <name>СуммаЛимита</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5fbff804-958b-4a5f-900d-b83d348fa40c">
    <name>КоличествоДнейОтсрочки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="abc05dce-0b75-43cf-8f35-d7efa819d1d1">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="f0132935-e901-4b5d-9ef9-7301216d9332">
    <name>ВариантВыбора</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0f9d4b04-969d-4a8a-aa25-f439557944e6">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e42b0c5b-bfc5-4c4c-800c-e36fb141c619">
    <name>Периодично</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08282529-def8-476e-860f-395b38d08e44">
    <name>ПервоначальныеДанные</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1109fa6d-e859-464e-a823-410c4c1693b2">
    <name>ПредставлениеПериода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="e87ec4cf-e29a-4ec1-aaea-e46d7c521959">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="087563bf-9775-42fd-b545-e1e0945b9369">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="29881099-61b3-4910-9353-ee4900415c4a">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЛимитыДоговоров/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	если Параметры.Свойство("ЗаполнениеПоДоговору") тогда	
		Элементы.Договор.Видимость=ложь;
		ЗаполнитьЗначенияСвойств(Запись,Параметры);
		если не значениезаполнено(Запись.Ответственный) тогда
			Запись.Ответственный=Пользователи.ТекущийПользователь();
		конецесли;	
	конецесли;
	если значениезаполнено(Запись.Договор) тогда
		Контрагент=Запись.Договор.Контрагент;
		Организация=Запись.Договор.Организация;
	конецесли;
	если не значениезаполнено(Запись.Ответственный) тогда
		 Запись.Ответственный=Пользователи.ТекущийПользователь();
	конецесли;
	ОтобразитьОформлениеПериод();
КонецПроцедуры

&НаСервере
Процедура ОтобразитьОформлениеПериод()
	Элементы.ДатаОкончания.Доступность=истина;
	если запись.ВариантВыбора=0 тогда
		Элементы.Периодично.Доступность=истина;
	иначеесли запись.ВариантВыбора=1 тогда
		Элементы.ДатаОкончания.Доступность=Ложь;
		Элементы.Периодично.Доступность=ложь;
	конецесли;
КонецПроцедуры
&НаСервере
Процедура ЗаписатьПредставление()
	если запись.ВариантВыбора=0 тогда
		СТР_ПредставлениеПериода="С "+Формат(запись.ДатаНачала, "ДФ=dd.MM.гггг")+" по "+Формат(запись.ДатаОкончания, "ДФ=dd.MM.гггг");
		если Запись.Периодично тогда
			СТР_ПредставлениеПериода=СТР_ПредставлениеПериода+" с пролонгацией";
		конецесли;	
	иначеесли запись.ВариантВыбора=1 тогда
		СТР_ПредставлениеПериода="С "+Формат(запись.ДатаНачала, "ДФ=dd.MM.гггг")+" бессрочно";
	конецесли;	
	Запись.ПредставлениеПериода=СТР_ПредставлениеПериода; 

КонецПроцедуры


&НаКлиенте
Процедура БессрочноПриИзменении(Элемент)
	ОтобразитьОформлениеПериод();
	если Запись.Периодично тогда
		 Запись.Периодично=ложь;
	 Конецесли;	 
	 Запись.ДатаОкончания="";
	 ЗаписатьПредставление();
	 
КонецПроцедуры

&НаКлиенте
Процедура ДействуетДоДатыПриИзменении(Элемент)
	ОтобразитьОформлениеПериод();
	ЗаписатьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ПериодичноПриИзменении(Элемент)
	ЗаписатьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
		ЗаписатьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
		ЗаписатьПредставление();
КонецПроцедуры
